zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v2.h
/*******************************************************************************
* Local definition
*******************************************************************************/
/*
 *  Definition of the default configuration of the CSD HW registers that is
 *  intended to be used on the CSD HW block capturing stage.
 *  The configuration includes:
 *  1. Start of the analog settling process:
 *      - Enables the CSD HW block;
 *      - Enables all the modules of the CSD HW block (AMBUF, REFGEN, CSDCMP, HSCMP);
 *      - Enables the Sense Modulator output;
 *  2. Clear all of the pending interrupt requests of the CSD HW block (SAMPLE, INIT, ADC_RES);
 *  3. Sets into default state the rest of the CSD HW block registers which are not related
 *     to actions #1 and #2.
*/
    #define CY_CAPSENSE_CSD_CONFIG_DEFAULT  {\
    .config         = 0x84001000uL, /* ENABLE = "1", SENSE_EN = "1". Set other fields into default state. */\
    .spare          = 0x00000000uL, /* Set all fields into default state. */                                \
    .status         = 0x00000000uL, /* Set all fields into default state. */                                \
    .statSeq        = 0x00000000uL, /* Set all fields into default state. */                                \
    .statCnts       = 0x00000000uL, /* Set all fields into default state. */                                \
    .statHcnt       = 0x00000000uL, /* Set all fields into default state. */                                \
    .resultVal1     = 0x00000000uL, /* Set all fields into default state. */                                \
    .resultVal2     = 0x00000000uL, /* Set all fields into default state. */                                \
    .adcRes         = 0x00000000uL, /* Set all fields into default state. */                                \
    .intr           = 0x00000106uL, /* SAMPLE = "1", INIT = "1", ADC_RES = "1". */                          \
    .intrSet        = 0x00000000uL, /* Set all fields into default state. */                                \
    .intrMask       = 0x00000000uL, /* Set all fields into default state. */                                \
    .intrMasked     = 0x00000000uL, /* Set all fields into default state. */                                \
    .hscmp          = 0x00000001uL, /* HSCMP_EN  = "1". Set all other fields into default state. */         \
    .ambuf          = 0x00000001uL, /* PWR_MODE  = "1". Set all other fields into default state. */         \
    .refgen         = 0x00000001uL, /* REFGEN_EN = "1". Set all other fields into default state. */         \
    .csdCmp         = 0x00000001uL, /* CSDCMP_EN = "1". Set all other fields into default state. */         \
    .swRes          = 0x00000000uL, /* Set all fields into default state. */                                \
    .sensePeriod    = 0x0C000000uL, /* Set all fields into default state. */                                \
    .senseDuty      = 0x00000000uL, /* Set all fields into default state. */                                \
    .swHsPosSel     = 0x00000000uL, /* Set all fields into default state. */                                \
    .swHsNegSel     = 0x00000000uL, /* Set all fields into default state. */                                \
    .swShieldSel    = 0x00000000uL, /* Set all fields into default state. */                                \
    .swAmuxbufSel   = 0x00000000uL, /* Set all fields into default state. */                                \
    .swBypSel       = 0x00000000uL, /* Set all fields into default state. */                                \
    .swCmpPosSel    = 0x00000000uL, /* Set all fields into default state. */                                \
    .swCmpNegSel    = 0x00000000uL, /* Set all fields into default state. */                                \
    .swRefgenSel    = 0x00000000uL, /* Set all fields into default state. */                                \
    .swFwModSel     = 0x00000000uL, /* Set all fields into default state. */                                \
    .swFwTankSel    = 0x00000000uL, /* Set all fields into default state. */                                \
    .swDsiSel       = 0x00000000uL, /* Set all fields into default state. */                                \
    .ioSel          = 0x00000000uL, /* Set all fields into default state. */                                \
    .seqTime        = 0x00000000uL, /* Set all fields into default state. */                                \
    .seqInitCnt     = 0x00000000uL, /* Set all fields into default state. */                                \
    .seqNormCnt     = 0x00000000uL, /* Set all fields into default state. */                                \
    .adcCtl         = 0x00000000uL, /* Set all fields into default state. */                                \
    .seqStart       = 0x00000000uL, /* Set all fields into default state. */                                \
    .idacA          = 0x00000000uL, /* Set all fields into default state. */                                \
    .idacB          = 0x00000000uL, /* Set all fields into default state. */                                \
    }

    extern const cy_stc_csd_config_t cy_capsense_csdCfg;
#endif


/*******************************************************************************
* CSD HW Waveform Selection values
*******************************************************************************/
#define CY_CAPSENSE_CSD_WAVEFORM_STATIC_OPEN                    (0x00000000uL)
#define CY_CAPSENSE_CSD_WAVEFORM_STATIC_CLOSED                  (0x00000001uL)
#define CY_CAPSENSE_CSD_WAVEFORM_PHI1                           (0x00000002uL)
#define CY_CAPSENSE_CSD_WAVEFORM_PHI2                           (0x00000003uL)
#define CY_CAPSENSE_CSD_WAVEFORM_PHI1_HSCMP                     (0x00000004uL)
#define CY_CAPSENSE_CSD_WAVEFORM_PHI2_HSCMP                     (0x00000005uL)
#define CY_CAPSENSE_CSD_WAVEFORM_HSCMP                          (0x00000006uL)
#define CY_CAPSENSE_CSD_WAVEFORM_SENSE_INV                      (0x00000007uL)
#define CY_CAPSENSE_CSD_WAVEFORM_PHI1_DELAY                     (0x00000008uL)
#define CY_CAPSENSE_CSD_WAVEFORM_PHI2_DELAY                     (0x00000009uL)
#define CY_CAPSENSE_CSD_WAVEFORM_PHI1_INV                       (0x0000000AuL)
#define CY_CAPSENSE_CSD_WAVEFORM_PHI2_INV                       (0x0000000BuL)
#define CY_CAPSENSE_CSD_WAVEFORM_PHI1_HSCMP_INV                 (0x0000000CuL)
#define CY_CAPSENSE_CSD_WAVEFORM_PHI2_HSCMP_INV                 (0x0000000DuL)
#define CY_CAPSENSE_CSD_WAVEFORM_HSCMP_INV                      (0x0000000EuL)
#define CY_CAPSENSE_CSD_WAVEFORM_SENSE                          (0x0000000FuL)


