zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v2.h
#define CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_F2PT_MSK              (CSD_SW_FW_TANK_SEL_SW_F2PT_Msk)
#define CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_F2PT_STATIC_CLOSE     (CY_CAPSENSE_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_F2PT_Pos)
#define CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_F2MA_MSK              (CSD_SW_FW_TANK_SEL_SW_F2MA_Msk)
#define CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_F2MA_STATIC_CLOSE     (CY_CAPSENSE_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_F2MA_Pos)
#define CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_F2CA_MSK              (CSD_SW_FW_TANK_SEL_SW_F2CA_Msk)
#define CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_F2CA_STATIC_CLOSE     (CY_CAPSENSE_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_F2CA_Pos)
#define CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_F2CB_MSK              (CSD_SW_FW_TANK_SEL_SW_F2CB_Msk)
#define CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_F2CB_STATIC_CLOSE     (CY_CAPSENSE_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_F2CB_Pos)
#define CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_F2CA_PHI2             (CY_CAPSENSE_CSD_WAVEFORM_PHI2 << CSD_SW_FW_TANK_SEL_SW_F2CA_Pos)
#define CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_F2CB_PHI2             (CY_CAPSENSE_CSD_WAVEFORM_PHI2 << CSD_SW_FW_TANK_SEL_SW_F2CB_Pos)
#define CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_C2CC_STATIC_OPEN      (CY_CAPSENSE_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_C2CC_Pos)
#define CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_C2CC_STATIC_CLOSE     (CY_CAPSENSE_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_C2CC_Pos)
#define CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_C2CD_STATIC_OPEN      (CY_CAPSENSE_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_C2CD_Pos)
#define CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_C2CD_STATIC_CLOSE     (CY_CAPSENSE_CSD_WAVEFORM_STATIC_CLOSED << CSD_SW_FW_TANK_SEL_SW_C2CD_Pos)

#if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
    #define CY_CAPSENSE_CSD_TX_OUT_MSK                          (0u)
    #define CY_CAPSENSE_CSD_TX_OUT_EN_PHI1_DELAY                (0u)
    #define CY_CAPSENSE_CSD_TX_AMUXB_EN_PHI2_DELAY              (0u)
    #define CY_CAPSENSE_CSD_TX_N_OUT_STATIC_CLOSE               (0u)
    #define CY_CAPSENSE_CSD_TX_N_OUT_EN_PHI1                    (0u)
    #define CY_CAPSENSE_CSD_TX_N_AMUXA_EN_PHI2                  (0u)
#else
    #define CY_CAPSENSE_CSD_TX_OUT_MSK                          (CSD_IO_SEL_CSD_TX_OUT_Msk)
    #define CY_CAPSENSE_CSD_TX_OUT_EN_PHI1_DELAY                (CY_CAPSENSE_CSD_WAVEFORM_PHI1_DELAY << 4u)
    #define CY_CAPSENSE_CSD_TX_AMUXB_EN_PHI2_DELAY              (CY_CAPSENSE_CSD_WAVEFORM_PHI2_DELAY << 12u)
    #define CY_CAPSENSE_CSD_TX_N_OUT_STATIC_CLOSE               (CY_CAPSENSE_CSD_WAVEFORM_STATIC_CLOSED << CSD_IO_SEL_CSD_TX_N_OUT_Pos)
    #define CY_CAPSENSE_CSD_TX_N_OUT_EN_PHI1                    (CY_CAPSENSE_CSD_WAVEFORM_PHI1 << CSD_IO_SEL_CSD_TX_N_OUT_EN_Pos)
    #define CY_CAPSENSE_CSD_TX_N_AMUXA_EN_PHI2                  (CY_CAPSENSE_CSD_WAVEFORM_PHI2 << CSD_IO_SEL_CSD_TX_N_AMUXA_EN_Pos)
#endif

/* CSD_SEQ_INIT_CNT register masks */
#define CY_CAPSENSE_CSD_SEQ_INIT_CNT_CONV_CNT_MSK               (CSD_SEQ_INIT_CNT_CONV_CNT_Msk)

/* CSD_SEQ_NORM_CNT register masks */
#define CY_CAPSENSE_CSD_SEQ_NORM_CNT_CONV_CNT_MSK               (CSD_SEQ_NORM_CNT_CONV_CNT_Msk)

/* CSD_SEQ_START register masks */
#define CY_CAPSENSE_CSD_SEQ_START_START_MSK                     (CSD_SEQ_START_START_Msk)
#define CY_CAPSENSE_CSD_SEQ_START_SEQ_MODE_MSK                  (CSD_SEQ_START_SEQ_MODE_Msk)
#define CY_CAPSENSE_CSD_SEQ_START_ABORT_MSK                     (CSD_SEQ_START_ABORT_Msk)
#define CY_CAPSENSE_CSD_SEQ_START_DSI_START_EN_MSK              (CSD_SEQ_START_DSI_START_EN_Msk)
#define CY_CAPSENSE_CSD_SEQ_START_AZ0_SKIP_MSK                  (CSD_SEQ_START_AZ0_SKIP_Msk)
#define CY_CAPSENSE_CSD_SEQ_START_AZ1_SKIP_MSK                  (CSD_SEQ_START_AZ1_SKIP_Msk)

#define CY_CAPSENSE_CSD_IDAC_BITS_USED                          (7u)

#define CY_CAPSENSE_CAL_MIDDLE_VALUE                            (1u << (CY_CAPSENSE_CSD_IDAC_BITS_USED - 1u))
#define CY_CAPSENSE_CAL_IDAC_MAX_VALUE                          ((uint8_t)(1u << CY_CAPSENSE_CSD_IDAC_BITS_USED) - 1u)


/* CSD_IDACA register masks */
#define CY_CAPSENSE_CSD_IDACA_VAL_MSK                           (CSD_IDACA_VAL_Msk)
#define CY_CAPSENSE_CSD_IDACA_VAL_POS                           (CSD_IDACA_VAL_Pos)

#define CY_CAPSENSE_CSD_IDACA_POL_DYN_MSK                       (CSD_IDACA_POL_DYN_Msk)
#define CY_CAPSENSE_CSD_IDACA_POL_DYN_POS                       (CSD_IDACA_POL_DYN_Pos)

#define CY_CAPSENSE_CSD_IDACA_POLARITY_MSK                      (CSD_IDACA_POLARITY_Msk)
#define CY_CAPSENSE_CSD_IDACA_POLARITY_POS                      (CSD_IDACA_POLARITY_Pos)
#define CY_CAPSENSE_CSD_IDACA_POLARITY_VSSA_SRC                 (0uL)
#define CY_CAPSENSE_CSD_IDACA_POLARITY_VDDA_SNK                 (1uL)
#define CY_CAPSENSE_CSD_IDACA_POLARITY_SENSE                    (2uL)
#define CY_CAPSENSE_CSD_IDACA_POLARITY_SENSE_INV                (3uL)

#define CY_CAPSENSE_CSD_IDACA_BALL_MODE_MSK                     (CSD_IDACA_BAL_MODE_Msk)
#define CY_CAPSENSE_CSD_IDACA_BALL_MODE_POS                     (CSD_IDACA_BAL_MODE_Pos)
#define CY_CAPSENSE_CSD_IDACA_BALL_MODE_FULL                    (0uL)
#define CY_CAPSENSE_CSD_IDACA_BALL_MODE_PHI1                    (1uL)
#define CY_CAPSENSE_CSD_IDACA_BALL_MODE_PHI2                    (2uL)
#define CY_CAPSENSE_CSD_IDACA_BALL_MODE_PHI1_2                  (3uL)

#define CY_CAPSENSE_CSD_IDACA_LEG1_MODE_MSK                     (CSD_IDACA_LEG1_MODE_Msk)
#define CY_CAPSENSE_CSD_IDACA_LEG1_MODE_POS                     (CSD_IDACA_LEG1_MODE_Pos)
#define CY_CAPSENSE_CSD_IDACA_LEG1_MODE_GP_STATIC               (0uL)
#define CY_CAPSENSE_CSD_IDACA_LEG1_MODE_GP                      (1uL)
#define CY_CAPSENSE_CSD_IDACA_LEG1_MODE_CSD_STATIC              (2uL)
#define CY_CAPSENSE_CSD_IDACA_LEG1_MODE_CSD                     (3uL)

#define CY_CAPSENSE_CSD_IDACA_LEG2_MODE_MSK                     (CSD_IDACA_LEG2_MODE_Msk)
#define CY_CAPSENSE_CSD_IDACA_LEG2_MODE_POS                     (CSD_IDACA_LEG2_MODE_Pos)
#define CY_CAPSENSE_CSD_IDACA_LEG2_MODE_GP_STATIC               (0uL)
#define CY_CAPSENSE_CSD_IDACA_LEG2_MODE_GP                      (1uL)
#define CY_CAPSENSE_CSD_IDACA_LEG2_MODE_CSD_STATIC              (2uL)
#define CY_CAPSENSE_CSD_IDACA_LEG2_MODE_CSD                     (3uL)

#define CY_CAPSENSE_CSD_IDACA_RANGE_MSK                         (CSD_IDACA_RANGE_Msk)
#define CY_CAPSENSE_CSD_IDACA_RANGE_POS                         (CSD_IDACA_RANGE_Pos)
#define CY_CAPSENSE_CSD_IDACA_RANGE_IDAC_LO                     (0uL)
#define CY_CAPSENSE_CSD_IDACA_RANGE_IDAC_MED                    (1uL)
#define CY_CAPSENSE_CSD_IDACA_RANGE_IDAC_HI                     (2uL)

#define CY_CAPSENSE_CSD_IDACA_LEG1_EN_MSK                       (CSD_IDACA_LEG1_EN_Msk)
#define CY_CAPSENSE_CSD_IDACA_LEG2_EN_MSK                       (CSD_IDACA_LEG2_EN_Msk)

/* CSD_IDACB register masks */
#define CY_CAPSENSE_CSD_IDACB_VAL_MSK                          (CSD_IDACB_VAL_Msk)
#define CY_CAPSENSE_CSD_IDACB_VAL_POS                          (CSD_IDACB_VAL_Pos)

