zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_sensing_v2.h
#define CY_CAPSENSE_CSD_IDACB_POL_DYN_MSK                       (CSD_IDACB_POL_DYN_Msk)
#define CY_CAPSENSE_CSD_IDACB_POL_DYN_POS                       (CSD_IDACB_POL_DYN_Pos)
#define CY_CAPSENSE_CSD_IDACB_POL_DYN_STATIC                    (0uL)
#define CY_CAPSENSE_CSD_IDACB_POL_DYN_DYNAMIC                   (1uL)

#define CY_CAPSENSE_CSD_IDACB_POLARITY_MSK                      (CSD_IDACB_POLARITY_Msk)
#define CY_CAPSENSE_CSD_IDACB_POLARITY_POS                      (CSD_IDACB_POLARITY_Pos)
#define CY_CAPSENSE_CSD_IDACB_POLARITY_VSSA_SRC                 (0uL)
#define CY_CAPSENSE_CSD_IDACB_POLARITY_VDDA_SNK                 (1uL)
#define CY_CAPSENSE_CSD_IDACB_POLARITY_SENSE                    (2uL)
#define CY_CAPSENSE_CSD_IDACB_POLARITY_SENSE_INV                (3uL)

#define CY_CAPSENSE_CSD_IDACB_BALL_MODE_MSK                     (CSD_IDACB_BAL_MODE_Msk)
#define CY_CAPSENSE_CSD_IDACB_BALL_MODE_POS                     (CSD_IDACB_BAL_MODE_Pos)
#define CY_CAPSENSE_CSD_IDACB_BALL_MODE_FULL                    (0uL)
#define CY_CAPSENSE_CSD_IDACB_BALL_MODE_PHI1                    (1uL)
#define CY_CAPSENSE_CSD_IDACB_BALL_MODE_PHI2                    (2uL)
#define CY_CAPSENSE_CSD_IDACB_BALL_MODE_PHI1_2                  (3uL)

#define CY_CAPSENSE_CSD_IDACB_LEG1_MODE_MSK                     (CSD_IDACB_LEG1_MODE_Msk)
#define CY_CAPSENSE_CSD_IDACB_LEG1_MODE_POS                     (CSD_IDACB_LEG1_MODE_Pos)
#define CY_CAPSENSE_CSD_IDACB_LEG1_MODE_GP_STATIC               (0uL)
#define CY_CAPSENSE_CSD_IDACB_LEG1_MODE_GP                      (1uL)
#define CY_CAPSENSE_CSD_IDACB_LEG1_MODE_CSD_STATIC              (2uL)
#define CY_CAPSENSE_CSD_IDACB_LEG1_MODE_CSD                     (3uL)

#define CY_CAPSENSE_CSD_IDACB_LEG2_MODE_MSK                     (CSD_IDACB_LEG2_MODE_Msk)
#define CY_CAPSENSE_CSD_IDACB_LEG2_MODE_POS                     (CSD_IDACB_LEG2_MODE_Pos)
#define CY_CAPSENSE_CSD_IDACB_LEG2_MODE_GP_STATIC               (0uL)
#define CY_CAPSENSE_CSD_IDACB_LEG2_MODE_GP                      (1uL)
#define CY_CAPSENSE_CSD_IDACB_LEG2_MODE_CSD_STATIC              (2uL)
#define CY_CAPSENSE_CSD_IDACB_LEG2_MODE_CSD                     (3uL)

#define CY_CAPSENSE_CSD_IDACB_RANGE_MSK                         (CSD_IDACB_RANGE_Msk)
#define CY_CAPSENSE_CSD_IDACB_RANGE_POS                         (CSD_IDACB_RANGE_Pos)
#define CY_CAPSENSE_CSD_IDACB_RANGE_IDAC_LO                     (0uL)
#define CY_CAPSENSE_CSD_IDACB_RANGE_IDAC_MED                    (1uL)
#define CY_CAPSENSE_CSD_IDACB_RANGE_IDAC_HI                     (2uL)

#define CY_CAPSENSE_CSD_IDACB_LEG1_EN_MSK                       (CSD_IDACB_LEG1_EN_Msk)
#define CY_CAPSENSE_CSD_IDACB_LEG2_EN_MSK                       (CSD_IDACB_LEG2_EN_Msk)
#define CY_CAPSENSE_CSD_IDACB_LEG3_EN_MSK                       (CSD_IDACB_LEG3_EN_Msk)

/*******************************************************************************
* PRS & LFSR masks
*******************************************************************************/
#define CY_CAPSENSE_PRS_LENGTH_8_BITS                           (0x000000FFuL)
#define CY_CAPSENSE_PRS_LENGTH_12_BITS                          (0x00000FFFuL)

#define CY_CAPSENSE_SNSCLK_SSC1_PERIOD                          (63u)
#define CY_CAPSENSE_SNSCLK_SSC2_PERIOD                          (127u)
#define CY_CAPSENSE_SNSCLK_SSC3_PERIOD                          (511u)
#define CY_CAPSENSE_SNSCLK_SSC4_PERIOD                          (1023u)

#define CY_CAPSENSE_SNSCLK_LFSR_RANGE                           (16u)
#define CY_CAPSENSE_LFSR_DITHER_PERCENTAGE                      (10uL)
#define CY_CAPSENSE_SNSCLK_LFSR_THRESHOLD                       (CY_CAPSENSE_LFSR_DITHER_PERCENTAGE * CY_CAPSENSE_SNSCLK_LFSR_RANGE)

/*******************************************************************************
* HSIOM and PC Macros redefinition platform dependent and for readability
*******************************************************************************/
#define CY_CAPSENSE_DM_GPIO_ANALOG                          (CY_GPIO_DM_ANALOG)
#define CY_CAPSENSE_DM_GPIO_STRONG_IN_OFF                   (CY_GPIO_DM_STRONG_IN_OFF)
#if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
    #define CY_CAPSENSE_HSIOM_SEL_GPIO                          (HSIOM_SEL_GPIO)
    #define CY_CAPSENSE_HSIOM_SEL_CSD_SENSE                     (HSIOM_SEL_CSD_SENSE)
    #define CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD                    (HSIOM_SEL_CSD_SHIELD)
    #define CY_CAPSENSE_HSIOM_SEL_AMUXA                         (HSIOM_SEL_AMUXA)
    #define CY_CAPSENSE_HSIOM_SEL_AMUXB                         (HSIOM_SEL_AMUXB)
    #define CY_CAPSENSE_DM_SHIELD                               (CY_GPIO_DM_ANALOG)
    #define CY_CAPSENSE_CSD_SCAN_PIN_DM                         (CY_GPIO_DM_ANALOG)
    #define CY_CAPSENSE_CSX_TX_SCAN_PIN_HSIOM                   (HSIOM_SEL_CSD_SENSE)
    #define CY_CAPSENSE_CSX_CINT_SCAN_PIN_HSIOM                 (HSIOM_SEL_AMUXA)
#else
    #define CY_CAPSENSE_HSIOM_SEL_GPIO                          (HSIOM_SEL_GPIO)
    #define CY_CAPSENSE_HSIOM_SEL_CSD_SENSE                     (HSIOM_SEL_ACT_3)
    #define CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD                    (HSIOM_SEL_ACT_2)
    #define CY_CAPSENSE_HSIOM_SEL_AMUXA                         (HSIOM_SEL_AMUXA)
    #define CY_CAPSENSE_HSIOM_SEL_AMUXB                         (HSIOM_SEL_AMUXB)
    #define CY_CAPSENSE_DM_SHIELD                               (CY_GPIO_DM_STRONG_IN_OFF)
    #define CY_CAPSENSE_CSD_SCAN_PIN_DM                         (CY_GPIO_DM_STRONG_IN_OFF)
    #define CY_CAPSENSE_CSX_TX_SCAN_PIN_HSIOM                   (HSIOM_SEL_ACT_2)
    #define CY_CAPSENSE_CSX_CINT_SCAN_PIN_HSIOM                 (HSIOM_SEL_GPIO)
#endif

/*******************************************************************************
* Clock Macros
*******************************************************************************/
#define CY_CAPSENSE_MODCLK_CMD_DIV_SHIFT                        (0uL)
#define CY_CAPSENSE_MODCLK_CMD_PA_DIV_SHIFT                     (8uL)
#define CY_CAPSENSE_MODCLK_CMD_DISABLE_SHIFT                    (30uL)
#define CY_CAPSENSE_MODCLK_CMD_ENABLE_SHIFT                     (31uL)
#define CY_CAPSENSE_MODCLK_CMD_DISABLE_MASK                     ((uint32_t)(1uL << CY_CAPSENSE_MODCLK_CMD_DISABLE_SHIFT))
#define CY_CAPSENSE_MODCLK_CMD_ENABLE_MASK                      ((uint32_t)(1uL << CY_CAPSENSE_MODCLK_CMD_ENABLE_SHIFT))

#define CY_CAPSENSE_MOD_CSD_CLK_12000000_HZ                     (12000000uL)
#define CY_CAPSENSE_MOD_CSD_CLK_24000000_HZ                     (24000000uL)
#define CY_CAPSENSE_MOD_CSD_CLK_48000000_HZ                     (48000000uL)

#define CY_CAPSENSE_MIN_SNS_CLK_DIVIDER                         (4000u)

#define CY_CAPSENSE_PERI_CLK_KHZ                                (50000000U / 1000U)
#define CY_CAPSENSE_PERI_CLK_MHZ                                (CY_CAPSENSE_PERI_CLK_KHZ / 1000U)

#define CY_CAPSENSE_CPU_CLK_KHZ                                 (50000000U / 1000U)
#define CY_CAPSENSE_CPU_CLK_MHZ                                 (CY_CAPSENSE_CPU_CLK_KHZ / 1000U)

/*******************************************************************************
* Miscellaneous Macros
*******************************************************************************/
#define CY_CAPSENSE_2000_MV                                     (2000u)

#if defined(__cplusplus)
}
#endif

#endif /* (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2)) */

#endif /* CY_CAPSENSE_SENSING_V2_H */


/* [] END OF FILE */
